wimalopaan/wmucpp/include_stm32/pwm.h
#pragma once

#include <type_traits>
#include <concepts>
#include <array>

#include "mcu/mcu.h"
#include "mcu/mcu_traits.h"
#include "mcu/alternate.h"
#include "units.h"
#include "concepts.h"
#include "meta.h"

#include "timer.h"
#include "dma.h"

namespace Mcu::Stm {
    using namespace Units::literals;

#ifdef USE_MCU_STM_V2
    inline
#endif
        namespace V2 {
        namespace Pwm {

            template<uint8_t TimerNumber, typename Clock, typename MCU = DefaultMcu>
            struct Simple {
                static inline /*constexpr */ TIM_TypeDef* const mcuTimer = reinterpret_cast<TIM_TypeDef*>(Mcu::Stm::Address<Mcu::Components::Timer<TimerNumber>>::value);

                using component_t = Mcu::Components::Timer<TimerNumber>;


                static inline constexpr uint16_t period = 1640;
                static inline uint32_t freq  = 20000;
                static inline uint16_t prescaler = (Clock::config::frequency.value / (freq * period));

#ifdef STM32G4
                static inline void init() {
                    if constexpr (TimerNumber == 1) {
                        RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
                    }
                    else if constexpr (TimerNumber == 2) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM2EN;
                    }
                    else if constexpr (TimerNumber == 3) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM3EN;
                    }
                    else if constexpr (TimerNumber == 4) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM4EN;
                    }
                    else {
                        static_assert(false);
                    }
                    mcuTimer->PSC = prescaler;
                    mcuTimer->ARR = period;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC1M_Pos); // pwm1
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC2M_Pos); // pwm2
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC3M_Pos); // pwm3
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC4M_Pos); // pwm4
                    mcuTimer->CCER |= TIM_CCER_CC1E;
                    mcuTimer->CCER |= TIM_CCER_CC2E;

                    mcuTimer->CCR1 = 0;
                    mcuTimer->CCR2 = 0;
                    mcuTimer->CCR3 = 0;
                    mcuTimer->CCR4 = 0;
                    mcuTimer->CR1 |= TIM_CR1_ARPE;

                    mcuTimer->CR2 |= (0b010 << TIM_CR2_MMS_Pos); // update as trigger-output

                    mcuTimer->CR1 |= TIM_CR1_CEN;
                }
#endif
#ifdef STM32G0
                static inline void init() {
                    if constexpr (TimerNumber == 1) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM1EN;
                    }
                    else if constexpr (TimerNumber == 3) {
                        RCC->APBENR1 |= RCC_APBENR1_TIM3EN;
                    }
                    else if constexpr (TimerNumber == 14) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM14EN;
                    }
                    else if constexpr (TimerNumber == 17) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM17EN;
                    }
                    else {
                        static_assert(false);
                    }
                    mcuTimer->PSC = prescaler;
                    mcuTimer->ARR = period;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC1M_Pos); // pwm1
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC2M_Pos); // pwm2
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC3M_Pos); // pwm3
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC4M_Pos); // pwm4
                    mcuTimer->CCER |= TIM_CCER_CC1E;
                    mcuTimer->CCER |= TIM_CCER_CC2E;
                    mcuTimer->CCER |= TIM_CCER_CC3E;
                    mcuTimer->CCER |= TIM_CCER_CC4E;

                    if constexpr ((TimerNumber == 1) || (TimerNumber == 17)) {
                        mcuTimer->BDTR |= TIM_BDTR_MOE;
                        mcuTimer->CCER |= TIM_CCER_CC1E;
                    }
                    if constexpr ((TimerNumber == 17)) { // hack
                        mcuTimer->CCER |= TIM_CCER_CC1NE;
                    }
                    mcuTimer->CCR1 = 0;
                    mcuTimer->CCR2 = 0;
                    mcuTimer->CCR3 = 0;
                    mcuTimer->CCR4 = 0;
                    mcuTimer->CR1 |= TIM_CR1_ARPE;

                    mcuTimer->CR2 |= (0b010 << TIM_CR2_MMS_Pos); // update as trigger-output

                    mcuTimer->CR1 |= TIM_CR1_CEN;
                }
#endif
                template<auto Channel>
                static inline void enableInts() {
                    if constexpr(Channel == 1) {
                        mcuTimer->DIER |= TIM_DIER_CC1IE;
                    }
                    else if constexpr(Channel == 2) {
                        mcuTimer->DIER |= TIM_DIER_CC2IE;
                    }
                    else if constexpr(Channel == 3) {
                        mcuTimer->DIER |= TIM_DIER_CC3IE;
                    }
                    else if constexpr(Channel == 4) {
                        mcuTimer->DIER |= TIM_DIER_CC4IE;
                    }
                    else {
                        static_assert(false);
                    }
                    mcuTimer->DIER |= TIM_DIER_UIE;
                }
                template<auto Channel>
                static inline void enableDma() {
                    if constexpr(Channel == 1) {
                        mcuTimer->DIER |= TIM_DIER_CC1DE;
                    }
                    else if constexpr(Channel == 2) {
                        mcuTimer->DIER |= TIM_DIER_CC2DE;
                    }
                    else if constexpr(Channel == 3) {
                        mcuTimer->DIER |= TIM_DIER_CC3DE;
                    }
                    else if constexpr(Channel == 4) {
                        mcuTimer->DIER |= TIM_DIER_CC4DE;
                    }
                    else {
                        static_assert(false);
                    }
                    mcuTimer->DIER |= TIM_DIER_UDE;
                }

                static inline void frequency(const uint16_t f) {
                    freq = f;
                    prescaler = (Clock::config::frequency.value / (freq * period));
                    mcuTimer->PSC = prescaler;
                    mcuTimer->EGR |= TIM_EGR_UG;
                }
                static inline void freqCenties(const uint8_t centies) {
                    frequency(centies * 100U);
                }

                static inline void duty1(const uint16_t v) {
                    mcuTimer->CCR1 = v;
                }
                static inline void duty2(const uint16_t v) {
                    mcuTimer->CCR2 = v;
                }
                static inline void duty3(const uint16_t v) {
                    mcuTimer->CCR3 = v;
                }
                static inline void duty4(const uint16_t v) {
                    mcuTimer->CCR4 = v;
                }

                constexpr static inline uint8_t trgo() {
                    if constexpr(TimerNumber == 3) {
                        return 4; // tim3-trgo
                    }
                    else if constexpr(TimerNumber == 2) {
                        return 11; // tim2-trgo
                    }
                    else if constexpr(TimerNumber == 4) {
                        return 12; // tim4-trgo
                    }
                }
            };


            // Cyclic DMA        
            template<uint8_t TimerNumber, uint8_t MaxLength, typename DmaChannelList, typename Clock, typename MCU = DefaultMcu>
            struct Sequence;

            template<uint8_t TimerNumber, uint8_t MaxLength, typename... DmaChannels, typename Clock, typename MCU>
            struct Sequence<TimerNumber, MaxLength, Meta::List<DmaChannels...>, Clock, MCU> {
                static inline /*constexpr */ TIM_TypeDef* const mcuTimer = reinterpret_cast<TIM_TypeDef*>(Mcu::Stm::Address<Timer<TimerNumber, void, void, MCU>>::value);

